tests/fixtures/requests/response-parsing.yml

-
  input:
    response: |
      <?xml version='1.0' encoding='UTF-8'?>
      <S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
          <S:Body>
              <ns0:createRequestsResponse xmlns:ns0="http://eu.europa.ec.dgt.epoetry">
                  <return statusCode="ENV">
                      <reference year="2018" number="2249" part="0" version="0" id="1738" internalReference="MYREF-DEF-123456" productType="TRA" requesterCode="DGT"/>
                      <generalInfo>
                          <title>Title of the Document</title>
                          <internalReference>MYREF-DEF-123456</internalReference>
                          <requestedDeadline>2018-11-30T12:00:00+01:00</requestedDeadline>
                          <sensitive>false</sensitive>
                          <documentToBeAdopted>false</documentToBeAdopted>
                          <sentViaRUE>false</sentViaRUE>
                          <destinationCode>INTERNE</destinationCode>
                          <slaAnnex>ANNEX8B</slaAnnex>
                          <comment>comment</comment>
                          <accessibleTo>DIR</accessibleTo>
                      </generalInfo>
                      <contacts>
                          <contact firstName="Paolo" lastName="Levi" email="" userId="paolevi" roleCode="REQUESTER"/>
                          <contact firstName="Angela" lastName="Heda" email="" userId="angheda" roleCode="AUTHOR"/>
                      </contacts>
                      <originalDocument format="TXT" type="ORI" name="test1.txt" trackChanges="false" pages="0.0">
                          <linguisticSections>
                              <linguisticSection>
                                  <language code="FR"/>
                              </linguisticSection>
                              <linguisticSection>
                                  <language code="EN"/>
                              </linguisticSection>
                          </linguisticSections>
                      </originalDocument>
                      <productRequests>
                          <productRequest requestedDeadline="2019-11-15T12:00:00+01:00" formatCode="NA" statusCode="ENV" trackChanges="false">
                              <language code="EN"/>
                          </productRequest>
                          <productRequest requestedDeadline="2019-11-15T12:00:00+01:00" formatCode="NA" statusCode="ENV" trackChanges="false">
                              <language code="DE"/>
                          </productRequest>
                          <productRequest requestedDeadline="2019-04-15T12:00:00+02:00" formatCode="NA" statusCode="ENV" trackChanges="false">
                              <language code="CS"/>
                          </productRequest>
                          <productRequest requestedDeadline="2019-11-15T12:00:00+01:00" formatCode="NA" statusCode="ENV" trackChanges="false">
                              <language code="FR"/>
                          </productRequest>
                          <productRequest formatCode="NA" statusCode="ENV" trackChanges="false">
                              <language code="BG"/>
                          </productRequest>
                      </productRequests>
                      <auxiliaryDocuments>
                          <auxiliaryDocument format="TXT" type="REF" name="test1.txt" language="RO"/>
                          <auxiliaryDocument format="TXT" type="REF" name="test1.txt" language="ML"/>
                      </auxiliaryDocuments>
                  </return>
                  <return statusCode="ENV">
                      <reference year="2018" number="2251" part="0" version="0" id="1739" internalReference="MYREF-DEF-123456" productType="TRA" requesterCode="DGT"/>
                      <generalInfo>
                          <title>Title of the Document vpi</title>
                          <internalReference>MYREF-DEF-123456</internalReference>
                          <requestedDeadline>2018-11-30T12:00:00+01:00</requestedDeadline>
                          <sensitive>false</sensitive>
                          <documentToBeAdopted>false</documentToBeAdopted>
                          <sentViaRUE>false</sentViaRUE>
                          <destinationCode>INTERNE</destinationCode>
                          <slaAnnex>ANNEX8B</slaAnnex>
                          <comment>comment</comment>
                          <accessibleTo>DIR</accessibleTo>
                      </generalInfo>
                      <contacts>
                          <contact firstName="Paolo" lastName="Levi" email="" userId="paolevi" roleCode="REQUESTER"/>
                          <contact firstName="Angela" lastName="Heda" email="" userId="angheda" roleCode="AUTHOR"/>
                      </contacts>
                      <originalDocument format="TXT" type="ORI" name="test1.txt" trackChanges="false" pages="0.0">
                          <linguisticSections>
                              <linguisticSection>
                                  <language code="FR"/>
                              </linguisticSection>
                              <linguisticSection>
                                  <language code="EN"/>
                              </linguisticSection>
                          </linguisticSections>
                      </originalDocument>
                      <productRequests>
                          <productRequest requestedDeadline="2019-11-15T12:00:00+01:00" formatCode="NA" statusCode="ENV" trackChanges="false">
                              <language code="FR"/>
                          </productRequest>
                          <productRequest requestedDeadline="2019-11-15T12:00:00+01:00" formatCode="NA" statusCode="ENV" trackChanges="false">
                              <language code="EN"/>
                          </productRequest>
                          <productRequest formatCode="NA" statusCode="ENV" trackChanges="false">
                              <language code="BG"/>
                          </productRequest>
                          <productRequest requestedDeadline="2019-04-15T12:00:00+02:00" formatCode="NA" statusCode="ENV" trackChanges="false">
                              <language code="CS"/>
                          </productRequest>
                          <productRequest requestedDeadline="2019-11-15T12:00:00+01:00" formatCode="NA" statusCode="ENV" trackChanges="false">
                              <language code="DE"/>
                          </productRequest>
                      </productRequests>
                      <auxiliaryDocuments>
                          <auxiliaryDocument format="TXT" type="REF" name="test1.txt" language="ML"/>
                          <auxiliaryDocument format="TXT" type="REF" name="test1.txt" language="RO"/>
                      </auxiliaryDocuments>
                  </return>
              </ns0:createRequestsResponse>
          </S:Body>
      </S:Envelope>
    request:
      linguisticRequest:
        - contacts:
            contact:
              - UserId: '1'
                RoleCode: AUTHOR
              - UserId: '2'
                RoleCode: EDITOR
          generalInfo:
            Title: Test
            InternalReference: '1'
            InternalTechnicalId: '1'
            RequestedDeadline:
              time: '2020-02-02'
              timezone: null
            Sensitive: false
            DocumentToBeAdopted: true
            DecideReference: decideReference
            SentViaRUE: true
            DestinationCode: PUBLIC
            SlaAnnex: ''
            SlaCommitment: ''
            Comment: ''
            OnBehalfOf: ''
            AccessibleTo: ''
  expectations:
    request: |
      <?xml version="1.0" encoding="UTF-8"?>
      <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://eu.europa.ec.dgt.epoetry">
      <SOAP-ENV:Body>
      <ns1:createRequests>
      <linguisticRequest><generalInfo><title>Test</title><internalReference>1</internalReference><internalTechnicalId>1</internalTechnicalId><requestedDeadline>2020-02-02T00:00:00+00:00</requestedDeadline><sensitive>false</sensitive><documentToBeAdopted>true</documentToBeAdopted><decideReference>decideReference</decideReference><sentViaRUE>true</sentViaRUE><destinationCode>PUBLIC</destinationCode><slaAnnex></slaAnnex><slaCommitment></slaCommitment><comment></comment><onBehalfOf></onBehalfOf><accessibleTo></accessibleTo></generalInfo>
      <contacts><contact userId="1" roleCode="AUTHOR"/><contact userId="2" roleCode="EDITOR"/></contacts>
      </linguisticRequest>
      </ns1:createRequests>
      </SOAP-ENV:Body>
      </SOAP-ENV:Envelope>
    assertions:
      assertCount:
        response.getReturn(): 2
        response.getReturn()[0].getContacts().getContact(): 2
        response.getReturn()[0].getAuxiliaryDocuments().getAuxiliaryDocument(): 2
        response.getReturn()[0].getOriginalDocument().getLinguisticSections().getLinguisticSection(): 2
        response.getReturn()[0].getProductRequests().getProductRequest(): 5
      assertSame:
        response.getReturn()[0].getStatusCode(): ENV
        response.getReturn()[0].getAuxiliaryDocuments().getAuxiliaryDocument()[0].getLanguage(): RO
        response.getReturn()[0].getAuxiliaryDocuments().getAuxiliaryDocument()[0].getFormat(): TXT
        response.getReturn()[0].getAuxiliaryDocuments().getAuxiliaryDocument()[0].getType(): REF
        response.getReturn()[0].getAuxiliaryDocuments().getAuxiliaryDocument()[0].getName(): test1.txt
        response.getReturn()[0].getAuxiliaryDocuments().getAuxiliaryDocument()[1].getLanguage(): ML
        response.getReturn()[0].getAuxiliaryDocuments().getAuxiliaryDocument()[1].getFormat(): TXT
        response.getReturn()[0].getAuxiliaryDocuments().getAuxiliaryDocument()[1].getType(): REF
        response.getReturn()[0].getAuxiliaryDocuments().getAuxiliaryDocument()[1].getName(): test1.txt
        response.getReturn()[0].getContacts().getContact()[0].getEmail(): ''
        response.getReturn()[0].getContacts().getContact()[0].getFirstName(): 'Paolo'
        response.getReturn()[0].getContacts().getContact()[0].getLastName(): 'Levi'
        response.getReturn()[0].getContacts().getContact()[0].getRoleCode(): 'REQUESTER'
        response.getReturn()[0].getContacts().getContact()[0].getUserId(): 'paolevi'
        response.getReturn()[0].getContacts().getContact()[1].getEmail(): ''
        response.getReturn()[0].getContacts().getContact()[1].getFirstName(): 'Angela'
        response.getReturn()[0].getContacts().getContact()[1].getLastName(): 'Heda'
        response.getReturn()[0].getContacts().getContact()[1].getRoleCode(): 'AUTHOR'
        response.getReturn()[0].getContacts().getContact()[1].getUserId(): 'angheda'
        response.getReturn()[0].getGeneralInfo().getAccessibleTo(): DIR
        response.getReturn()[0].getGeneralInfo().getComment(): comment
        response.getReturn()[0].getGeneralInfo().getDestinationCode(): INTERNE
        response.getReturn()[0].getGeneralInfo().getInternalReference(): MYREF-DEF-123456
        response.getReturn()[0].getGeneralInfo().getSlaAnnex(): ANNEX8B
        response.getReturn()[0].getGeneralInfo().getRequestedDeadline().format('Y-m-j'): "2018-11-30"
        response.getReturn()[0].getOriginalDocument().getPages(): 0.0
        response.getReturn()[0].getOriginalDocument().getFormat(): TXT
        response.getReturn()[0].getOriginalDocument().getName(): test1.txt
        response.getReturn()[0].getOriginalDocument().getType(): ORI
        response.getReturn()[0].getOriginalDocument().getLinguisticSections().getLinguisticSection()[0].getLanguage().getCode(): FR
        response.getReturn()[0].getOriginalDocument().getLinguisticSections().getLinguisticSection()[1].getLanguage().getCode(): EN
        response.getReturn()[0].getProductRequests().getProductRequest()[0].isTrackChanges(): false
        response.getReturn()[0].getProductRequests().getProductRequest()[0].getStatusCode(): ENV
        response.getReturn()[0].getProductRequests().getProductRequest()[0].getFormatCode(): NA
        response.getReturn()[0].getProductRequests().getProductRequest()[0].getLanguage().getCode(): EN
        response.getReturn()[0].getProductRequests().getProductRequest()[0].getRequestedDeadline().format('Y-m-j'): "2019-11-15"
        response.getReturn()[0].getProductRequests().getProductRequest()[1].isTrackChanges(): false
        response.getReturn()[0].getProductRequests().getProductRequest()[1].getStatusCode(): ENV
        response.getReturn()[0].getProductRequests().getProductRequest()[1].getFormatCode(): NA
        response.getReturn()[0].getProductRequests().getProductRequest()[1].getLanguage().getCode(): DE
        response.getReturn()[0].getProductRequests().getProductRequest()[1].getRequestedDeadline().format('Y-m-j'): "2019-11-15"
        response.getReturn()[0].getProductRequests().getProductRequest()[2].isTrackChanges(): false
        response.getReturn()[0].getProductRequests().getProductRequest()[2].getStatusCode(): ENV
        response.getReturn()[0].getProductRequests().getProductRequest()[2].getFormatCode(): NA
        response.getReturn()[0].getProductRequests().getProductRequest()[2].getLanguage().getCode(): CS
        response.getReturn()[0].getProductRequests().getProductRequest()[2].getRequestedDeadline().format('Y-m-j'): "2019-04-15"
        response.getReturn()[0].getProductRequests().getProductRequest()[3].isTrackChanges(): false
        response.getReturn()[0].getProductRequests().getProductRequest()[3].getStatusCode(): ENV
        response.getReturn()[0].getProductRequests().getProductRequest()[3].getFormatCode(): NA
        response.getReturn()[0].getProductRequests().getProductRequest()[3].getLanguage().getCode(): FR
        response.getReturn()[0].getProductRequests().getProductRequest()[3].getRequestedDeadline().format('Y-m-j'): "2019-11-15"
        response.getReturn()[0].getProductRequests().getProductRequest()[4].isTrackChanges(): false
        response.getReturn()[0].getProductRequests().getProductRequest()[4].getStatusCode(): ENV
        response.getReturn()[0].getProductRequests().getProductRequest()[4].getFormatCode(): NA
        response.getReturn()[0].getProductRequests().getProductRequest()[4].getLanguage().getCode(): BG
        response.getReturn()[0].getReference().getId(): 1738
        response.getReturn()[0].getReference().getInternalReference(): MYREF-DEF-123456
        response.getReturn()[0].getReference().getNumber(): 2249
        response.getReturn()[0].getReference().getPart(): 0
        response.getReturn()[0].getReference().getProductType(): TRA
        response.getReturn()[0].getReference().getRequesterCode(): DGT
        response.getReturn()[0].getReference().getVersion(): 0
        response.getReturn()[0].getReference().getYear(): 2018
      assertNull:
        response.getReturn()[0].getGeneralInfo().getInternalTechnicalId(): ~
        response.getReturn()[0].getGeneralInfo().getOnBehalfOf(): ~
        response.getReturn()[0].getGeneralInfo().getRequestingService(): ~
        response.getReturn()[0].getGeneralInfo().getServiceOfOrigin(): ~
        response.getReturn()[0].getGeneralInfo().getDecideReference(): ~
        response.getReturn()[0].getGeneralInfo().getSlaCommitment(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[0].getAcceptedDeadline(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[0].getInternalProductReference(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[1].getAcceptedDeadline(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[1].getInternalProductReference(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[2].getAcceptedDeadline(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[2].getInternalProductReference(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[3].getAcceptedDeadline(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[3].getInternalProductReference(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[4].getAcceptedDeadline(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[4].getInternalProductReference(): ~
        response.getReturn()[0].getProductRequests().getProductRequest()[4].getRequestedDeadline(): ~
        response.getReturn()[0].getReference().getInternalTechnicalId(): ~

